emacs_config.org
* Emacs Literate Config
:PROPERTIES:
:ID: emacs-config-root
:END:

The pattern due to limiations using :var with quoted strings
is to return a string using format + concat (if needed),
:results value with escaped quoted strings. This enables the
use of '<<()>>' consistently for accessing variables. Consuming
code blocks will will require :noweb yes. :var is not used
at this time. The is enables a consitent approach for quoted
and non-quoted strings. This is the only way I could figure
out how to do this so that the approach was the same for quoted
and non-quoted strings.
   
* Environment
:PROPERTIES:
:ID: env-setup
:END:

Defines external environment variables and configurations used across modules.
Manually modify the `active-env` block below to switch between prod/dev environments.

Options emacs-prod | emacs-dev
#+NAME: target-env
#+BEGIN_SRC emacs-lisp :results value

  (format "\"%s\"" "emacs-prod")
#+END_SRC

#+RESULTS: target-env
: "emacs-prod"

Set target os.

Options archlinux | windows
#+NAME: target-os
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "archlinux")  
#+END_SRC

#+RESULTS: target-os
: "archlinux"

Variable definitions for those variables that can shared across all
modules and enviroments. These should be used judiciously.
All other variable definitions should be within their respective code blocks.
#+NAME: emacs-common-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/.config/emacs-common")
#+END_SRC

#+RESULTS: emacs-common-dir
: "~/.config/emacs-common"

Set evnrionment variables.
#+NAME: env-vars
#+BEGIN_SRC emacs-lisp :noweb yes  :tangle ./modules/env.el
  (setq my/env <<target-env()>>)
  (setq server-name <<target-env()>>) 
#+END_SRC

#+RESULTS: env-vars
: emacs-prod

Starts emacs in server mode.
#+NAME: run-as-server
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  (require 'server)
  (unless (server-running-p)
     (server-start))
#+END_SRC

Turn off yes/no prompt for evaluating org buffer.
#+NAME: confirm-babel-evaluate
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  ;; Turn of eval protection
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

* Core
:PROPERTIES:
:ID: core
:END:

Core (native) emacs behavior configurtation. These setting should be the same across any of my hardware / os
environments (e.g. laptop, desktop, pi).

#+NAME: core
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/core.el
  (setq inhibit-startup-screen t)
  (setq inhibit-startup-message t)
  (setq ring-bell-function 'ignore)
  (setq make-backup-files nil)

  ;; Initialize package system
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                            ("org" . "https://orgmode.org/elpa/")
                            ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Ensure use-package is available
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  ;; Auto update packages
  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

  ;; Clean up configuration file locations
  (use-package no-littering)

  ;; Ensure auto-save files go into no-littering's designated auto-save dir
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

* Core-Extensions
:PROPERTIES:
:ID: core-extensions
:END:

Core extenstions to native emacs behavior. Ideally these will be the same across all environments.

#+NAME: core-extensions
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/core-extensions.el
  ;; Enable which-key for keybinding discovery
  (use-package which-key
    :defer 0
    :diminish
    :config
    (which-key-mode))

  ;; Completion and search system
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
    :bind (("C-M-j" . counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))

  (use-package ivy-rich
    :after counsel
    :init
    (ivy-rich-mode 1))

  ;; Use to prioritize command history based on usage.
  (use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  ;(prescient-persist-mode 1)
  (ivy-prescient-mode 1))

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+END_SRC

