emacs_config.org
* UI
:PROPERTIES:
:ID: ui-config
:END:

UI configuration. Use the for frame / window decorations.

#+NAME: ui-config
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/ui.el
     ;; Font sizing defaults for UI scaling (override per-host if needed)
     (defvar my/default-font-size 100)
     (defvar my/default-variable-font-size 100)

     ;; Frame transparency defaults
     (defvar my/frame-transparency '(90 . 90))

     ;; Disable unnecessary UI elements
     (scroll-bar-mode -1)
     (tool-bar-mode -1)
     (tooltip-mode -1)
     (menu-bar-mode -1)
     (set-fringe-mode 10)

     ;; Set up the visible bell
     (setq visible-bell t)

     ;; Show column and line numbers
     (column-number-mode)
     (global-display-line-numbers-mode t)

     ;; Set frame font and theme
     (set-face-attribute 'default nil :font "JetBrains Mono" :height my/default-font-size)
     (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height my/default-font-size)
     (set-face-attribute 'variable-pitch nil :font "Cantarell" :height my/default-variable-font-size :weight 'regular)

     ;; Apply frame transparency
     (set-frame-parameter (selected-frame) 'alpha my/frame-transparency)
     (add-to-list 'default-frame-alist `(alpha . ,my/frame-transparency))

     ;; Icons and modeline
     (use-package all-the-icons)

     (use-package doom-themes
     :init (load-theme 'doom-palenight t))

     (use-package doom-modeline
       :init (doom-modeline-mode 1)
       :custom ((doom-modeline-height 15)))

     ;; Shows window numbers to select to change window
     (use-package ace-window
     :ensure t
     :bind (("M-o" . ace-window)))

     ;; Focus follows mouse
   (setq mouse-autoselect-window t)

    ;; Setup window borders like wtm
   (window-divider-mode 1)
   (setq window-divider-default-places t)
   (setq window-divider-default-bottom-width 1)
   (setq window-divider-default-right-width 1)

   ;; Set all borders to orange
  (set-face-attribute 'window-divider nil :foreground "orange")
  (set-face-attribute 'vertical-border nil :foreground "orange")

  ;; Mode line borders - also orange
  (set-face-attribute 'mode-line nil
                    :background "#4c566a"
                    :foreground "#eceff4"
                    :box '(:line-width 1 :color "orange"))

  (set-face-attribute 'mode-line-inactive nil
                    :background "#2e3440"
                    :foreground "#88909f"
                    :box '(:line-width 1 :color "orange"))

;;  Window shading - active window much darker
  (defvar my-active-window-background "#000000")    ; Very dark for active
  (defvar my-inactive-window-background "#2a2a2a")  ; Lighter for inactive

  (defun my-apply-window-shading ()
  "Apply shading - active window darker, inactive lighter."
     (dolist (window (window-list))
       (with-current-buffer (window-buffer window)
         (face-remap-reset-base 'default)
         (if (eq window (selected-window))
             ;; Active window - much darker
             (face-remap-add-relative 'default :background my-active-window-background)
           ;; Inactive windows - lighter
           (face-remap-add-relative 'default :background my-inactive-window-background)))))

  ;; Apply shading on window changes
  (add-hook 'window-selection-change-functions 
          (lambda (&rest _) (my-apply-window-shading)))

  ;; Protect settings from being overridden
  (defun my-protect-window-settings (&rest _)
     (when window-divider-mode
       (setq window-divider-default-bottom-width 1)
       (setq window-divider-default-right-width 1))
     (set-face-attribute 'window-divider nil :foreground "orange")
     (set-face-attribute 'vertical-border nil :foreground "orange")
     (my-apply-window-shading))

  (advice-add 'load-theme :after #'my-protect-window-settings)

  ;; Initialize everything
  (my-apply-window-shading)

  ;; End of Window Configuration
  (put 'erase-buffer 'disabled nil)    
 #+END_SRC

* Org
:PROPERTIES:
:ID: org-basic
:END:

Dedicated section for Org due to its scope of potential use and integration with emacs native.

Random notes, commands, quotes, etc. file.
#+NAME: random-notes-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/Documents/stuff/random_notes.org")
#+END_SRC

#+RESULTS: random-notes-dir
: "~/Documents/stuff/random_notes.org"

Random notes function.
#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/org.el
 (use-package org
        :defer t )
  
  (setq my/random-notes-file <<random-notes-dir()>>)

    ;; Org Capture Template
    (setq org-capture-templates
          '(("r" "Random quick note"
             entry
             (file+headline my/random-notes-file "Inbox")
             "* %U %?\n  :tags: %^{Tags}\n"
             :empty-lines 1)))
    (global-set-key (kbd "C-c r") 'org-capture)
 #+END_SRC

 Enable python code blocks in babel.
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/org.el
 (org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
 #+END_SRC
 
* Email
:PROPERTIES:
:ID: email
:END:

Dedicated section for email due to its scope of potential use and integration with emacs native.

#+NAME: yahoo-email-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/Maildir/yahoo")
#+END_SRC

#+RESULTS: yahoo-email-dir
: "~/Maildir/yahoo"

#+NAME: yahoo-email-address
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "mkburns61@yahoo.com")    
#+END_SRC

#+RESULTS: yahoo-email-address
: "mkburns61@yahoo.com"

#+NAME: yahoo-email-fullname
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "Mike Burns")    
#+END_SRC

#+RESULTS: yahoo-email-fullname
: "Mike Burns"

Big brother contacts database location.
#+NAME: bbdb-dir
#+BEGIN_SRC emacs-lisp :noweb yes :results value
  (format "\"%s\"" (concat <<emacs-common-dir()>>"/bbdb"))
#+END_SRC

#+RESULTS: bbdb-dir
: "~/.config/emacs-common/bbdb"


#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/email.el

    (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
    (require 'mu4e)

    (setq mu4e-maildir <<yahoo-email-dir()>>) ;; or wherever your Maildir lives
    (require 'mu4e)

    (setq user-mail-address <<yahoo-email-address()>>)
    (setq user-full-name <<yahoo-email-fullname()>>)

    (setq send-mail-function 'sendmail-send-it
          message-send-mail-function 'sendmail-send-it
          sendmail-program "/usr/bin/msmtp"
          mail-specify-envelope-from t
          mail-envelope-from 'header)

    (defun my/run-mbsync ()
      "Run mbsync to sync mail."
      (start-process-shell-command "mbsync" "*mbsync*" "mbsync -a"))

    ;; Run every 5 minutes (adjust as needed)
    (run-at-time "5 min" 300 #'my/run-mbsync)

    (setq mu4e-update-interval 300)  ;; 5 minutes

    ;; Setup image preview
    (setq mu4e-view-show-images t)
    (setq mu4e-view-use-gnus t) 
    (setq mu4e-view-image-max-width 800)
    (setq mu4e-view-show-addresses 't)

    (setq shr-inhibit-images nil)
    (setq gnus-inhibit-images nil)

    (defun my-mu4e-view-inline-images ()
      "Show images automatically in mu4e."
      (when (fboundp 'shr-put-image)
        (setq mu4e-view-show-images t)))

    (setq url-privacy-level 'low)

    (defun my/mu4e-view-message-no-focus ()
      "View the current message in another window without changing focus."
      (interactive)
      (let ((msg (mu4e-message-at-point)))
        (when msg
          (save-selected-window
            (mu4e-view msg)))))

    (with-eval-after-load 'mu4e
      (define-key mu4e-headers-mode-map (kbd "V") #'my/mu4e-view-message-no-focus))

    ;; Open email in a dedicated frame for better workflow.
    (defun my/mu4e-open-in-dedicated-frame ()
      "Open mu4e in a dedicated frame named 'mu4e'."
      (interactive)
      (let ((bufname "*mu4e*"))
        (if (get-buffer bufname)
            ;; If buffer already exists, raise the frame or switch to it
            (progn
              (select-frame-set-input-focus
               (window-frame (get-buffer-window bufname))))
          ;; Else create new frame and launch mu4e
  	(let* ((frame (make-frame '((name . "mu4e")
                                      (width . 100)
                                      (height . 40)))))
            (select-frame-set-input-focus frame)
            (with-selected-frame frame
              (mu4e)
              (set-window-dedicated-p (selected-window) t))))))

    ;; Use bbdb for email contacts configuration.
    (use-package bbdb
          :defer t )

    (setq bbdb-file <<bbdb-dir()>>)
    (require 'bbdb)
    (require 'bbdb-com)
    (bbdb-initialize 'mu4e 'message)

    (setq mu4e-use-bbdb t)

    (bbdb-mua-auto-update-init 'mu4e)

    (setq message-completion-alist
        '((message-to . bbdb-complete-mail)
          (message-cc . bbdb-complete-mail)
          (message-bcc . bbdb-complete-mail)))

    (define-key message-mode-map (kbd "TAB") 'bbdb-complete-mail)
 #+END_SRC

* Dev Environment
:PROPERTIES:
:ID: dev-env
:END:

My dev envrionments.

#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/dev.el
  (use-package typescript-mode
    :mode "\\.ts\\'")

  (use-package python-mode
    :hook (python-mode . eglot-ensure))

  (use-package pyvenv
    :config (pyvenv-mode 1))

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Documents/Code")
      (setq projectile-project-search-path '("~/Documents/Code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package request
  :ensure t)

  (require 'request)
  (require 'json)

  ;; ChatGPT AI integration.
  (setq chatgpt-shell-save-session t)
  (global-set-key (kbd "C-c g") #'chatgpt-shell)

  (setq chatgpt-shell-openai-key "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")

  (setq chatgpt-shell-anthropic-key "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")

  (setq chatgpt-shell-google-key "AIzaSyDkF0ZNBH208yLG48x_iv6kDVk0pjo6g3E")
#+END_SRC

