emacs_config.org
* System & OS Integration
:PROPERTIES:
:ID: system-os-env
:END:

System / OS integration that might change across hardware /OS's etc.

#+NAME: show-dotfiles
#+BEGIN_SRC emacs-lisp :results value :noweb yes
    (cond
     ((string= <<target-os()>> "archlinux")
      "(setq dired-listing-switches \"-alh --group-directories-first\")")
     ((string= <<target-os()>> "macos")
      "(setq dired-listing-switches \"-alh\")")
     (t "Unknown OS"))
#+END_SRC

#+RESULTS: show-dotfiles
: (setq dired-listing-switches "-alh --group-directories-first")

Dired configurations.
#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/system-os.el
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump)))

  <<show-dotfiles()>>

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; Launch apps based on content.
  (use-package dired-open
    :config
    (setq dired-open-extensions
  	'(("png" . "feh")
  	  ("jpg" . "feh")
  	  ("pdf" . "zathura")
  	  ("mp4" . "mpv")
  	  ("mkv" . "mpv")
  	  ("html" . "floorp"))))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode))

  ;; Must have dired extensions
  (use-package peep-dired
    :ensure t
    :bind (:map dired-mode-map
                ("P" . peep-dired))
    :hook (peep-dired-mode . (lambda () (setq-local image-dired-display-image-buffer 'other))))

  (use-package dired-subtree
    :ensure t
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)))
#+END_SRC

Terminal
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/system-os.el
  (use-package vterm
    :commands vterm
    :bind ("C-c v" . vterm)
    :config
    (setq vterm-shell "/usr/bin/fish")
    (setq vterm-max-scrollback 10000))
#+END_SRC

* My Functions
:PROPERTIES:
:ID: my-functions
:END:

This section is dedicated to my functions. These will eventually be generated based on target environment.

Niri literate config.kdl tangle and deploy. This function will evaluate
and tangle the niri config.kdl and deploy it into the correct niri
directory, with included rollback capability.

#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/my-functions.el
  (defun niri-babel-build-and-deploy ()
    "Execute all necessary blocks (except kdl), tangle, and deploy to ~/.config/niri/config.kdl"
    (interactive)
    (let* ((org-file "~/projects/niri_babel_config/niri_config.org")
           (output-dir "~/projects/niri_babel_config/")
           (output-file (expand-file-name "config.kdl" output-dir))
           (target-file "~/.config/niri/config.kdl"))
      (with-current-buffer (find-file-noselect org-file)
        ;; Execute only non-KDL blocks
        (org-babel-map-src-blocks org-file
          (let* ((info (org-babel-get-src-block-info))
                 (lang (nth 0 info)))
            (unless (string= lang "kdl")
              (org-babel-execute-src-block))))
        ;; Tangle everything
        (org-babel-tangle)
        ;; Copy the output
        (when (file-exists-p output-file)
          (copy-file output-file target-file t)
          (message "Tangled and copied config.kdl to %s" target-file)))))
 #+END_SRC

This is a prototype / test / learning function. To use it add this function to
emacsclient startup and it will display thumbnails for the screenshots directory,
allow you to select a single thumbnail, copy it to the clipboard and exit.
This is used in niri with a similar function using feh. The goal was to see
how close emacs could reproduce the feh functionality. The results are pretty
good and this is currently wired as a keybind in niri as is feh.

 #+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/my-functions.el
   (require 'image-dired)

   (defun my/image-dired-copy-and-exit ()
     "Copy image under point in image-dired and exit Emacsclient."
     (interactive)
     (let* ((file (image-dired-original-file-name))
            (copy-prog (or (executable-find "wl-copy")
                           (executable-find "xclip"))))
       (unless copy-prog
         (error "No clipboard utility (wl-copy or xclip) found"))
       (unless (and file (file-exists-p file))
         (error "No image found under cursor"))
       (with-temp-buffer
         (insert-file-contents-literally file)
         (call-process-region
          (point-min) (point-max)
          copy-prog nil nil nil "-t" "image/png"))
       (save-buffers-kill-terminal)))

   (with-eval-after-load 'image-dired
     ;; `m` to copy and exit
     (define-key image-dired-thumbnail-mode-map (kbd "m") #'my/image-dired-copy-and-exit)
     ;; `q` to just quit
     (define-key image-dired-thumbnail-mode-map (kbd "q")
       (lambda ()
         (interactive)
         (save-buffers-kill-terminal))))

   (defun my/image-picker-thumbnail-mode ()
     "Launch thumbnail-only image picker. Press `m` to copy & exit."
     (interactive)
     (let ((dir "~/Pictures/screenshots/"))
       ;; Save current window configuration, run image-dired
       (image-dired dir)
       ;; Force delete all windows except the one showing *image-dired*
       (let ((image-buffer "*image-dired*"))
         (dolist (win (window-list))
           (unless (eq (window-buffer win) (get-buffer image-buffer))
             (delete-window win)))
         (select-window (get-buffer-window image-buffer)))))
 #+END_SRC

Show the server name that this emacsclient is connected to.
 #+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/my-functions.el
    ;; Show the server name that this emacsclient is connected to.
    (defun show-current-server-name ()
      "Display the name of the Emacs server this client is connected to."
      (interactive)
      (message "Connected to Emacs server: %s" server-name))

    ;; Then bind it in the startup hook
    (add-hook 'emacs-startup-hook
              (lambda ()
                (global-set-key (kbd "<f12>") #'show-current-server-name)))
 #+END_SRC

List niri active windows.
 #+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/my-functions.el
   ;; Output niri-windows to new buffer
   (defun niri-windows ()
     "Show Niri windows in a new buffer."
     (interactive)
     (let ((buf (get-buffer-create "*niri-windows*")))
       (with-current-buffer buf
         (read-only-mode -1)
         (erase-buffer)
         (call-process "~/projects/niri_toolkit/niri-windows.py" nil buf)
         (goto-char (point-min))
         (read-only-mode 1))
       (pop-to-buffer buf)))
 #+END_SRC

Connect to niri IPC and display events in a buffer.
  #+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/my-functions.el
   ;;Output niri-event-stream via IPC to new buffer
   (defun niri-event-stream ()
     "Show the Niri event stream in a new buffer."
     (interactive)
     (let ((buf (get-buffer-create "*Niri Event Stream*")))
       (apply 'make-comint-in-buffer
              "Niri Event Stream"
              buf
              (expand-file-name "~/projects/niri_toolkit/niri-tail-event-stream.py")
              nil)
       (pop-to-buffer buf)))
 #+END_SRC

* Table of Contents / Manifest
:PROPERTIES:
:ID: toc-manifest
:END:

A high-level view of config modules.

| Section                 | ID              | Tangle Path                  | Notes                   |
|-------------------------+-----------------+------------------------------+-------------------------|
| Environment             | env-setup       | ./modules/env.el             | Shared values           |
| Core                    | core            | ./modules/core.el            | Emacs core              |
| Core-Extensions         | core-extensions | ./modules/core-extensions.el | Extension to emacs core |
| UI                      | ui-config       | ./modules/ui.el              | UI (Theme, font, etc.)  |
| Org                     | org-basic       | ./modules/org.el             | Org                     |
| Dev                     | dev-env         | ./modules/dev.el             | Dev tooling             |
| System & OS Integration | system-os-env   | ./modules/system-os.el       | System & OS Utilities   |
| Email                   | email           | ./modules/email.el           | Email                   |
| My Functions            | my-functions    | ./modules/my-functions.el    | My custom functions     |
